# PANDAS

In [2]:
import pandas as pd

Pandas Dasta Structures Series Data Frame
#########SERIES##########

In [4]:
s1=pd.Series([11,22,33,44,55,66,77,88,99,10])

In [6]:
s1 #pandas series object

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [8]:
#0 to 9 is index this is default index hai by series object

In [12]:
s1[9] #accessing value by index

10

In [13]:
s1[1,4,5,6,9]

KeyError: (1, 4, 5, 6, 9)

In [16]:
s1[[1,4,5,6,9]] #[] provide this [] inside [] like [[]]  for accessing multiple values

1    22
4    55
5    66
6    77
9    10
dtype: int64

In [17]:
                 s1

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [19]:
s1[5]=5555 #for modify the series or replace

In [20]:
s1

0      11
1      22
2      33
3      44
4      55
5    5555
6      77
7      88
8      99
9      10
dtype: int64

In [21]:
del s1[5]

In [22]:
s1

0    11
1    22
2    33
3    44
4    55
6    77
7    88
8    99
9    10
dtype: int64

In [26]:
#for multiple modify or replace more then one element in a series

In [27]:
s1[[2,3,4]]=[222,445,666]

In [25]:
s1

0     11
1     22
2    222
3    445
4    666
6     77
7     88
8     99
9     10
dtype: int64

In [30]:
del s1[[1,2,3]]

TypeError: '[[1, 2, 3]]' is an invalid key

In [32]:
#for inserting a value if given index not exist so it will add 
#the element to the series if index is exist so it will replace a previous value

In [33]:
s1[77]=[666]

In [34]:
s1

0        11
1        22
2       222
3       445
4       666
6        77
7        88
8        99
9        10
77    [666]
dtype: object

In [35]:
#inserting multiples values

In [38]:
s1[[11,22,33]]=[222,444,555]

ValueError: [11 22 33] not contained in the index

In [39]:
#multiple inserting not possible

In [41]:
s2=pd.Series([10,20,30,40],index=["oranges","apple","bananas","kiwi"]) #here index is behave like dictionary

In [42]:
s2

oranges    10
apple      20
bananas    30
kiwi       40
dtype: int64

In [43]:
s2.index

Index(['oranges', 'apple', 'bananas', 'kiwi'], dtype='object')

In [45]:
s2.values

array([10, 20, 30, 40], dtype=int64)

# defining our own indexing by assign variable to a index

In [46]:
#we can add index list by calling a variable

In [50]:
our_index=["oranges","apple","bananas","kiwi"]

In [51]:
s2=pd.Series([10,20,30,40],index=our_index)

In [52]:
s2

oranges    10
apple      20
bananas    30
kiwi       40
dtype: int64

In [53]:
s2>30

oranges    False
apple      False
bananas    False
kiwi        True
dtype: bool

In [54]:
#we do this in frame it give when greater than its show above values
#if less than sign present so it below numbers

In [55]:
s2[s2<30]

oranges    10
apple      20
dtype: int64

In [56]:
s2[s2>30]

kiwi    40
dtype: int64

In [57]:
s2[s2>40]

Series([], dtype: int64)

In [58]:
s2[s2<=30]

oranges    10
apple      20
bananas    30
dtype: int64

In [59]:
s2[s2>=30]

bananas    30
kiwi       40
dtype: int64

In [62]:
"bananas" in s2

True

In [65]:
"peach" in s2 #if required key is in index present or not

False

In [71]:
30 in s2 #only for keys give true false not for values

False

In [72]:
"40" in s2

False

# Creating a series by using a dictionary

In [5]:
import pandas as pd

In [6]:
#index is behave like key in pandass

In [7]:
sdata={"Ohio":3500,"texas":21000,"Oregon":16000,"utah":5000}

In [8]:
data=pd.Series(sdata)

In [9]:
data

Ohio       3500
Oregon    16000
texas     21000
utah       5000
dtype: int64

In [10]:
states=["Calrifornia","Ohio","Oregon","texas"]

In [11]:
data1=pd.Series(sdata,index=states)

In [12]:
data1

Calrifornia        NaN
Ohio            3500.0
Oregon         16000.0
texas          21000.0
dtype: float64

In [13]:
data1.notnull()

Calrifornia    False
Ohio            True
Oregon          True
texas           True
dtype: bool

In [14]:
data1["Calrifornia"]=71000

In [15]:
data1

Calrifornia    71000.0
Ohio            3500.0
Oregon         16000.0
texas          21000.0
dtype: float64

In [16]:
data1.notnull()

Calrifornia    True
Ohio           True
Oregon         True
texas          True
dtype: bool

In [17]:
data.isnull()

Ohio      False
Oregon    False
texas     False
utah      False
dtype: bool

# Data Frames

In [18]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [19]:
df1 = pd.DataFrame(data)

In [20]:
df1

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [21]:
data1={"Books":["Adventures of Sherlock Holmes","Alice in the Wonderland","As you like it","Area of Darkness"],"Author":["Sir Arthur Conan Doyle","Lewis Carroll","William Shakespeare","V.S. Naipaul"],"year":[1999,1945,1623,1964]}

In [22]:
df2=pd.DataFrame(data1)

In [23]:
df2

                   Author                          Books  year
0  Sir Arthur Conan Doyle  Adventures of Sherlock Holmes  1999
1           Lewis Carroll        Alice in the Wonderland  1945
2     William Shakespeare                 As you like it  1623
3            V.S. Naipaul               Area of Darkness  1964

In [24]:
type(df1)

pandas.core.frame.DataFrame

In [25]:
df1.shape

(6, 3)

In [26]:
df1["pop"]

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [27]:
df1[["pop","state"]]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [28]:
df1[["year","state"]]

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [29]:
del df1["pop"]

In [30]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [31]:
df1["debt"]=100

In [32]:
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   100
2    Ohio  2002   100
3  Nevada  2001   100
4  Nevada  2002   100
5  Nevada  2003   100

In [37]:
df1["debt"]=[100,200,300,100,800,600]

In [38]:
df1

    state  year  debt  dept
0    Ohio  2000   100   100
1    Ohio  2001   200   200
2    Ohio  2002   300   300
3  Nevada  2001   100   100
4  Nevada  2002   800   800
5  Nevada  2003   600   600

In [39]:
df1["debt"]=range(6)

In [40]:
df1

    state  year  debt  dept
0    Ohio  2000     0   100
1    Ohio  2001     1   200
2    Ohio  2002     2   300
3  Nevada  2001     3   100
4  Nevada  2002     4   800
5  Nevada  2003     5   600

In [41]:
df1["debt"]=df1["state"]

In [42]:
df1

    state  year    debt  dept
0    Ohio  2000    Ohio   100
1    Ohio  2001    Ohio   200
2    Ohio  2002    Ohio   300
3  Nevada  2001  Nevada   100
4  Nevada  2002  Nevada   800
5  Nevada  2003  Nevada   600

In [60]:
dic={"Ai for EO":[66,87,88,99,88,77,66,55],"python1":[95,77,99,67,78,88,89,99],"python2":[93,90,87,98,67,56,99,76]}

In [61]:
df=pd.DataFrame(dic,index=["naveen","sara","asad","ali","zara","amna","aiman","mahira"])

In [62]:
df

        Ai for EO  python1  python2
naveen         66       95       93
sara           87       77       90
asad           88       99       87
ali            99       67       98
zara           88       78       67
amna           77       88       56
aiman          66       89       99
mahira         55       99       76

In [64]:
df["totalmarks"]=df["Ai for EO"]+df["python1"]+df["python2"]

In [65]:
df

        Ai for EO  python1  python2  totalmarks
naveen         66       95       93         254
sara           87       77       90         254
asad           88       99       87         274
ali            99       67       98         264
zara           88       78       67         233
amna           77       88       56         221
aiman          66       89       99         254
mahira         55       99       76         230

In [69]:
df["percentage"]=df["totalmarks"]/300*100

In [70]:
df

        Ai for EO  python1  python2  totalmarks  percentage
naveen         66       95       93         254   84.666667
sara           87       77       90         254   84.666667
asad           88       99       87         274   91.333333
ali            99       67       98         264   88.000000
zara           88       78       67         233   77.666667
amna           77       88       56         221   73.666667
aiman          66       89       99         254   84.666667
mahira         55       99       76         230   76.666667

In [87]:
df["result"]=df["totalmarks"]> 250

In [88]:
df

        Ai for EO  python1  python2  totalmarks  percentage  result
naveen         66       95       93         254   84.666667    True
sara           87       77       90         254   84.666667    True
asad           88       99       87         274   91.333333    True
ali            99       67       98         264   88.000000    True
zara           88       78       67         233   77.666667   False
amna           77       88       56         221   73.666667   False
aiman          66       89       99         254   84.666667    True
mahira         55       99       76         230   76.666667   False

In [94]:

df['result'] = ["pass" if i >= 250 else "Fail" for i in df['totalmarks']]
df

        Ai for EO  python1  python2  totalmarks  percentage result
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   Fail
amna           77       88       56         221   73.666667   Fail
aiman          66       89       99         254   84.666667   pass
mahira         55       99       76         230   76.666667   Fail

In [100]:
df["result"]=["pass"if i<250  else "fail" for i in df["totalmarks"]]

In [101]:
df

        Ai for EO  python1  python2  totalmarks  percentage result
naveen         66       95       93         254   84.666667   fail
sara           87       77       90         254   84.666667   fail
asad           88       99       87         274   91.333333   fail
ali            99       67       98         264   88.000000   fail
zara           88       78       67         233   77.666667   pass
amna           77       88       56         221   73.666667   pass
aiman          66       89       99         254   84.666667   fail
mahira         55       99       76         230   76.666667   pass

In [102]:
#checking each test

# zip

In [103]:
a=list(range(5))
b=list(range(6,11))

In [104]:
a

[0, 1, 2, 3, 4]

In [105]:
b

[6, 7, 8, 9, 10]

In [106]:
c=zip(a,b)

In [107]:
for i in c:
    print(i)

(0, 6)
(1, 7)
(2, 8)
(3, 9)
(4, 10)

In [108]:
df["status"]=["pass" if ai>=33 and p1>3 and p2>33 else "fail" for ai,p1,p2 in zip(df["Ai for EO"],df["python1"],df["python2"])]

# must clear each test for pass

In [110]:
df

        Ai for EO  python1  python2  totalmarks  percentage result status
naveen         66       95       93         254   84.666667   fail   pass
sara           87       77       90         254   84.666667   fail   pass
asad           88       99       87         274   91.333333   fail   pass
ali            99       67       98         264   88.000000   fail   pass
zara           88       78       67         233   77.666667   pass   pass
amna           77       88       56         221   73.666667   pass   pass
aiman          66       89       99         254   84.666667   fail   pass
mahira         55       99       76         230   76.666667   pass   pass

In [111]:
del df["result"]

In [112]:
df

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass
amna           77       88       56         221   73.666667   pass
aiman          66       89       99         254   84.666667   pass
mahira         55       99       76         230   76.666667   pass

# head and tail

In [115]:
#by default head give five
#by default tail five five

In [116]:
df.head()

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass

In [117]:
df.head(1)

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass

In [118]:
df.tail()

        Ai for EO  python1  python2  totalmarks  percentage status
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass
amna           77       88       56         221   73.666667   pass
aiman          66       89       99         254   84.666667   pass
mahira         55       99       76         230   76.666667   pass

In [119]:
df.tail(2)

        Ai for EO  python1  python2  totalmarks  percentage status
aiman          66       89       99         254   84.666667   pass
mahira         55       99       76         230   76.666667   pass

# .loc and .iloc

In [120]:
#it will give index specification

In [121]:
df["naveen"]

KeyError: 'naveen'

In [122]:
df.loc["naveen"]

Ai for EO          66
python1            95
python2            93
totalmarks        254
percentage    84.6667
status           pass
Name: naveen, dtype: object

In [123]:
#slicing

In [124]:
df.loc["naveen":"zara"]

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass

In [126]:
df.iloc[1]

Ai for EO          87
python1            77
python2            90
totalmarks        254
percentage    84.6667
status           pass
Name: sara, dtype: object

In [128]:
df.iloc[0:5]

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass

In [129]:
df.iloc[2:5]

      Ai for EO  python1  python2  totalmarks  percentage status
asad         88       99       87         274   91.333333   pass
ali          99       67       98         264   88.000000   pass
zara         88       78       67         233   77.666667   pass

In [130]:
df.loc["naveen"]["python1"]

95

# for adding row

In [131]:
df.loc["abc"]=[1,2,3,4,5,6]

In [132]:
df

        Ai for EO  python1  python2  totalmarks  percentage status
naveen         66       95       93         254   84.666667   pass
sara           87       77       90         254   84.666667   pass
asad           88       99       87         274   91.333333   pass
ali            99       67       98         264   88.000000   pass
zara           88       78       67         233   77.666667   pass
amna           77       88       56         221   73.666667   pass
aiman          66       89       99         254   84.666667   pass
mahira         55       99       76         230   76.666667   pass
abc             1        2        3           4    5.000000      6